--- a/docs/did-authorization.md
+++ b/docs/did-authorization.md
@@ -70,26 +70,34 @@ A role can be defined in a JSON document. This makes it easy to store in a docum
 serialized and deserialized for RPC usage.
 
 The EWC flexhub has a list of roles which require approval in order to be valid.
+```plantuml
+@startuml
 
-```mermaid
-classDiagram
+Namespace --|> Role
+Role --|> Approval
+Approval --|> RoleApproval
 
-Namespace ..> Role
-Role ..> Approval
-Approval ..> RoleApproval
+class Namespace {
+    String name
+    Array<Role> roles
+}
 
-Namespace : String name
-Namespace : Array<Role> roles
+class Role {
+    String name
+    Approval approvals
+}
 
-Role : String name
-Role : Approval approvals
+class Approval {
+    Boolean authority
+    String authority-delegate
+    Array<RoleApproval> roles
+}
 
-Approval : Boolean authority
-Approval : String authority-delegate
-Approval : Array<RoleApproval> roles
-
-RoleApproval : String name
-RoleApproval : String delegate
+class RoleApproval {
+    String name
+    String delegate
+}
+@enduml
 ```
 ### Namespace
 
